embeddedci-com/benchpod-firmware/stm32h563/src/ethernetif.c
/**
  ******************************************************************************
  * @file    LwIP/LwIP_TCP_Echo_Server/LWIP/Target/ethernetif.c
  * @author  MCD Application Team
  * @brief   This file implements Ethernet network interface drivers for lwIP
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"
#include "lwip/opt.h"
#include "lwip/timeouts.h"
#include "lwip/netif.h"
#include "netif/etharp.h"
#include "ethernetif.h"
#include "board_uid.h"
#include "lan8742.h"
#include "board_pins.h"
#include "eth_diag.h"
#include <stdio.h>
#include <string.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Network interface name */
#define IFNAME0 's'
#define IFNAME1 't'

#define ETH_DMA_TRANSMIT_TIMEOUT                (20U)

/* One full Ethernet frame per RX buffer (was 1000 < a 1514-byte frame, which split every
   full packet across TWO DMA buffers — halving effective RX buffering and adding reassembly).
   A bigger pool (16 vs 12) leaves headroom above ETH_RX_DESC_CNT(4) DMA-armed buffers for an
   8-segment TCP window (TCP_WND) held by lwIP, so a cloud download isn't RX-starved into drops.
   RAM: +~12 KB. */
#define ETH_RX_BUFFER_SIZE            1536U
#define ETH_RX_BUFFER_CNT             16U
#define ETH_TX_BUFFER_MAX             ((ETH_TX_DESC_CNT) * 2U)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/*
@Note: This interface is implemented to operate in zero-copy mode only:
        - Rx Buffers will be allocated from LwIP stack Rx memory pool,
          then passed to ETH HAL driver.
        - Tx Buffers will be allocated from LwIP stack memory heap,
          then passed to ETH HAL driver.

@Notes:
  1.a. ETH DMA Rx descriptors must be contiguous, the default count is 4,
       to customize it please redefine ETH_RX_DESC_CNT in ETH GUI (Rx Descriptor Length)
       so that updated value will be generated in stm32xxxx_hal_conf.h
  1.b. ETH DMA Tx descriptors must be contiguous, the default count is 4,
       to customize it please redefine ETH_TX_DESC_CNT in ETH GUI (Tx Descriptor Length)
       so that updated value will be generated in stm32xxxx_hal_conf.h

  2.a. Rx Buffers number: ETH_RX_BUFFER_CNT must be greater than ETH_RX_DESC_CNT.
  2.b. Rx Buffers must have the same size: ETH_RX_BUFFER_SIZE, this value must
       passed to ETH DMA in the init field (heth.Init.RxBuffLen)
*/
typedef enum
{
  RX_ALLOC_OK       = 0x00,
  RX_ALLOC_ERROR    = 0x01
} RxAllocStatusTypeDef;

typedef struct
{
  struct pbuf_custom pbuf_custom;
  uint8_t buff[(ETH_RX_BUFFER_SIZE + 31) & ~31] __ALIGNED(32);
} RxBuff_t;

ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

/* Memory Pool Declaration */
LWIP_MEMPOOL_DECLARE(RX_POOL, ETH_RX_BUFFER_CNT, sizeof(RxBuff_t), "Zero-copy RX PBUF pool");



/* Variable Definitions */
static uint8_t RxAllocStatus;
static volatile uint32_t s_rx_alloc_fail;   /* RX pool empty events (eth_diag) */
static uint32_t s_rx_missed, s_rx_missed_ovf;  /* accumulated: DMACMFCR clears on read */
static volatile uint32_t s_rx_frames, s_rx_bcast;  /* every received frame (the MMC counts unicast only) */

_Static_assert(ETH_DIAG_MACCR_DM == ETH_MACCR_DM && ETH_DIAG_MACCR_FES == ETH_MACCR_FES,
               "eth_diag MACCR bits must match the CMSIS definitions");

/* Global Ethernet handle*/
ETH_HandleTypeDef EthHandle;
ETH_TxPacketConfig TxConfig;


/* Private function prototypes -----------------------------------------------*/
u32_t sys_now(void);

int32_t ETH_PHY_IO_Init(void);
int32_t ETH_PHY_IO_DeInit (void);
int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t *pRegVal);
int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t RegVal);
int32_t ETH_PHY_IO_GetTick(void);

lan8742_Object_t LAN8742;
lan8742_IOCtx_t  LAN8742_IOCtx = {ETH_PHY_IO_Init,
                               ETH_PHY_IO_DeInit,
                               ETH_PHY_IO_WriteReg,
                               ETH_PHY_IO_ReadReg,
                               ETH_PHY_IO_GetTick};


/* Private functions ---------------------------------------------------------*/
void pbuf_free_custom(struct pbuf *p);
/*******************************************************************************
                       LL Driver Interface ( LwIP stack --> ETH)
*******************************************************************************/
/**
  * @brief In this function, the hardware should be initialized.
  * Called from ethernetif_init().
  *
  * @param netif the already initialized lwip network interface structure
  *        for this ethernetif
  */
/* The MAC address, unique per pod: a locally administered unicast address (first byte 0x02)
   whose other five bytes hash the STM32's 96-bit unique device ID.  A fixed address made every
   pod on a LAN share one MAC, so two pods fought over a single DHCP lease.  Stable across
   reboots and reflashes (the UID is factory-programmed).
   The UID is read as whole words through board_uid.h. */
static void board_eth_mac(uint8_t mac[6])
{
  uint32_t w[3];
  board_uid_words(w);   /* whole words: see board_uid.h */
  uint32_t h = 2166136261u;                    /* FNV-1a over the 12 UID bytes */
  for (int i = 0; i < 3; i++) {
    for (int b = 0; b < 4; b++) {
      h ^= (w[i] >> (8 * b)) & 0xFFu;
      h *= 16777619u;
    }
  }
  uint32_t h2 = (h ^ 0x45u) * 16777619u;       /* one more round for the fifth byte */
  mac[0] = 0x02;
  mac[1] = (uint8_t)(h >> 24);
  mac[2] = (uint8_t)(h >> 16);
  mac[3] = (uint8_t)(h >> 8);
  mac[4] = (uint8_t)h;
  mac[5] = (uint8_t)(h2 >> 24);
}

static void low_level_init(struct netif *netif)
{
  static uint8_t macaddress[6];   /* HAL keeps the pointer: must outlive this call */
  board_eth_mac(macaddress);

