embeddedci-com/benchpod-firmware/stm32h563/src/ethernetif.c
/* Force the PHY's link mode instead of letting it autonegotiate, or put it back on
   autoneg (mbit = 0).  A DEBUG AID: 10BASE-T swings ~5x the voltage of 100BASE-TX,
   runs at a quarter of the symbol rate and tolerates a far looser reference clock, so
   a link that is lossy at 100M and clean at 10M points at the analog path (magnetics,
   RJ45, the PHY's 25 MHz reference) rather than the MAC, the driver or the network.

   A forced link does NOT autonegotiate, so a switch port that does will fall back to
   parallel detection and pick HALF duplex — which is why half is the sane default here.
   Forcing full against such a port is a duplex mismatch and produces late collisions
   and its own losses, so it stays opt-in.

   Returns 0 on success, -1 if the MDIO write failed. Net task only. */
int ethernetif_force_speed(struct netif *netif, int mbit, int full)
{
  uint32_t bcr = (mbit == 0) ? (LAN8742_BCR_AUTONEGO_EN | LAN8742_BCR_RESTART_AUTONEGO)
                             : ((mbit == 100 ? LAN8742_BCR_SPEED_SELECT : 0u) |
                                (full        ? LAN8742_BCR_DUPLEX_MODE  : 0u));
  HAL_ETH_Stop(&EthHandle);
  if (HAL_ETH_WritePHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_BCR, bcr) != HAL_OK) {
    netif_set_down(netif);
    netif_set_link_down(netif);
    return -1;
  }
  /* Mark the link down so the next ethernet_link_check_state() re-reads the PHY and
     reconfigures the MAC for whatever it now reports (the LAN8742 driver derives the
     mode from BCR when autoneg is off, so a forced link comes back up by itself). */
  netif_set_down(netif);
  netif_set_link_down(netif);
  return 0;
}

void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
  struct pbuf_custom *p = LWIP_MEMPOOL_ALLOC(RX_POOL);
  if (p)
  {
    /* Get the buff from the struct pbuf address. */
    *buff = (uint8_t *)p + offsetof(RxBuff_t, buff);
    p->custom_free_function = pbuf_free_custom;
    /* Initialize the struct pbuf.
    * This must be performed whenever a buffer's allocated because it may be
    * changed by lwIP or the app, e.g., pbuf_free decrements ref. */
    pbuf_alloced_custom(PBUF_RAW, 0, PBUF_REF, p, *buff, ETH_RX_BUFFER_SIZE);
  }
  else
  {
    if (RxAllocStatus != RX_ALLOC_ERROR) s_rx_alloc_fail++;
    RxAllocStatus = RX_ALLOC_ERROR;
    *buff = NULL;
  }
}

void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff, uint16_t Length)
{
  struct pbuf **ppStart = (struct pbuf **)pStart;
  struct pbuf **ppEnd = (struct pbuf **)pEnd;
  struct pbuf *p = NULL;

  /* Get the struct pbuf from the buff address. */
  p = (struct pbuf *)(buff - offsetof(RxBuff_t, buff));
  p->next = NULL;
  p->tot_len = 0;
  p->len = Length;

  /* Chain the buffer. */
  if (!*ppStart)
  {
    /* The first buffer of the packet. */
    *ppStart = p;
  }
  else
  {
    /* Chain the buffer to the end of the packet. */
    (*ppEnd)->next = p;
  }
  *ppEnd  = p;

  /* Update the total length of all the buffers of the chain. Each pbuf in the chain should have its tot_len
   * set to its own length, plus the length of all the following pbufs in the chain. */
  for (p = *ppStart; p != NULL; p = p->next)
  {
    p->tot_len += Length;
  }
}

void HAL_ETH_TxFreeCallback(uint32_t * buff)
{
  pbuf_free((struct pbuf *)buff);
}

/* ETH global interrupt — MspInit enables ETH_IRQn, so it must be serviced. */
void ETH_IRQHandler(void)
{
  HAL_ETH_IRQHandler(&EthHandle);
}



/* Fill `d` from the PHY (MDIO), the MAC and its MMC counters. Net task only: MDIO is not locked. */
void ethernetif_diag_refresh(struct netif *netif, eth_diag_t *d)
{
  uint32_t v = 0;
  memset(d, 0, sizeof(*d));
  d->phy_ok = true;
  /* BSR's link bit latches low: the first read reports a drop since the last read, the second now. */
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_BSR, &v) != HAL_OK ||
      HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_BSR, &v) != HAL_OK) d->phy_ok = false;
  d->bsr = (uint16_t)v;
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_PHYSCSR, &v) != HAL_OK) d->phy_ok = false;
  d->physcsr = (uint16_t)v;
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_ANLPAR, &v) != HAL_OK) d->phy_ok = false;
  d->anlpar = (uint16_t)v;
  if (HAL_ETH_ReadPHYRegister(&EthHandle, LAN8742.DevAddr, LAN8742_SECR, &v) != HAL_OK) d->phy_ok = false;
  d->symbol_errors = (uint16_t)v;

  d->maccr = ETH->MACCR;
  d->netif_link = netif_is_link_up(netif);
  d->rx_frames = s_rx_frames;
  d->rx_bcast = s_rx_bcast;
  d->rx_good = ETH->MMCRUPGR;
  d->rx_crc = ETH->MMCRCRCEPR;
  d->rx_align = ETH->MMCRAEPR;
  d->tx_good = ETH->MMCTPCGR;
  d->tx_col_single = ETH->MMCTSCGPR;
  d->tx_col_multi = ETH->MMCTMCGPR;
  uint32_t mfc = ETH->DMACMFCR;   /* clears on read */
  s_rx_missed += mfc & ETH_DMACMFCR_MFC;
  if (mfc & ETH_DMACMFCR_MFCO) s_rx_missed_ovf++;
  d->rx_missed = s_rx_missed;
  d->rx_missed_ovf = s_rx_missed_ovf;
  d->rx_alloc_fail = s_rx_alloc_fail;
  d->rx_alloc_stuck = (RxAllocStatus == RX_ALLOC_ERROR);
}
